\version "2.24.3"
% 1小節ごとに改行しています。
right = \relative c' {
  \clef treble

  \global

  % 2. rall. の点線（TextSpanner）のテキスト設定
  \override TextSpanner.bound-details.left.text = \markup { \italic "rall." }
  % rall. をコードネームよりも上に表示するための優先度設定
  \override TextSpanner.outside-staff-priority = #2000

  <g b c g'>8\arpeggio\mf [<b' b'> <a a'> <g g'>8] <g g'>\startTextSpan [<fis fis'> <e e'> \dimTextDim <fis fis'>8] \>

  <a a'>8 [<g g'> <fis fis'> <g g'>8] <d' g b d>4.\arpeggio <c c'>8

  <b g' b>4. a'8 <b, e a>8 e b <g g'>

  \time 2/4
  <a d fis a>2 
  \bar "||"

  \time 4/4
  <b dis fis b>2.  r8 b8-.-1 \stopTextSpan\!% ここで点線を終了
  % Aメロ開始：二重小節線と [A] マーク
  \bar "||"
  %{ \mark \default  % 自動で [A] が表示されるっす %}
  \mark \markup { \box \bold "A" }

  g'4^\markup { \italic "a tempo" }-5 r8 b,8-.-1 fis'4-4 r8 b,8-2
  
  e4-5 d8-.-4 [c-.-3] d4-4 r8 g,-.-1

  a-1 ([c-.-2) e-.-3 g8-.-5] fis-4 [(d-.-3) b-.-2 a-.-1]

  b2-3 r4 r8 b-.-1

  g'4-5 r8 b,8-.-1 fis'4-4 r8 b,-.-2

  e4-5 d8-.-4 [c-.-3] d4.-4 b8-.-2 
  
  a-1 [(c-.-2) e-.-3 g-.-4] a-4 [(b-.-5) fis-.-4 d-.-2]

  e2.-3 r8 b-1

  % Bメロ開始：二重小節線と [B] マーク
  \bar ".|:"
  \mark \markup { \box \bold "B" }
  g'4-5 r8 b,-1 fis'4-4 r8 b,-2

  <e-5 g,-1>4 d8-4 [c8-3] <d-4 g,-1>4 r8 g,-1 

  % -------------コレで一つの小節（4拍分）何をやっているのかわからなければ「楽譜 多声部記譜」で検索！------------
  <<
    { a8-1 [c-2 e-3 g-5]  fis-4 [d-2 b-3 a-2] } % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {r2                    a4-1      fis-1     } % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  % -------------コレで一つの小節（4拍分）------------
  <<
    {<d-1 g-3 b-5>2            r4     r8 b'-1}  % 上声部：8分音符×8個 ＝ 4拍分

    \\
    {r4           fis8-3 [e-1] dis4-2 fis-1} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  g'-5 r8 b,-1 fis'4-4 r8 b,-2

  e4-5 d8-4 [c-3] d4.-4 b8-2

  % -------------コレで一つの小節（4拍分）------------
  <<
    {a-1 [c-2 e-3 g-4] a-4 [b-5 fis-4 d-2]}  % 上声部：8分音符×8個 ＝ 4拍分

    \\
    {r2                d4-1        r4   } % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  % -------------コレで一つの小節（4拍分）------------
  <<
    {<g,-1 b-2 e-5>2.        r4}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {r2    r16 g-1 [a-2 b-3] c-1 [d-2 e-3 fis-4] } % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  % Cメロ開始：二重小節線と [C] マーク
  \bar "||"
  \mark \markup { \box \bold "C" }
  % -------------コレで一つの小節（4拍分）------------
  <<
    {g8 [g g g] g [fis e fis]}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {<c a>2      r2} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------mark

  % -------------コレで一つの小節（4拍分）------------
  <<
    {<d fis,> r4 r8 c16[d]}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {r4 <a a'> <g g'> <fis fis'>} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  % -------------コレで一つの小節（4拍分）------------
  <<
    {e'8 [e e e] e [d c d]}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {<c g>2 r2} % 下声部：2分休符×2個 ＝ 4拍分
  >>

  % -------------コレで一つの小節（4拍分）------------
  <<
    {<b d,>2. r8 b}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {r4 <g g'> <a a'> <b b'>} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  gis8 [a c e] <fis, d'>4. c'8

  % -------------コレで一つの小節（4拍分）------------
  <<
    {gis [b d fis] a[g fis g]}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {r2 <b, d>4 r4} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  <cis e b'>4.\arpeggio a'16[b] e,4. d16[e]

  b4. a16[b] d2

  \time 2/4
  <fis, dis>4 r8 b
 
  \bar ":|."
  \time 4/4
  <g b e>2. r4 
}
