\version "2.24.3"
% 1小節ごとに改行しています。
right = \relative c' {
  \clef treble

  \global

  % 2. rall. の点線（TextSpanner）のテキスト設定
  \override TextSpanner.bound-details.left.text = \markup { \italic "rall." }
  % rall. をコードネームよりも上に表示するための優先度設定
  \override TextSpanner.outside-staff-priority = #2000

  <g b c g'>8\arpeggio\mf [<b' b'> <a a'> <g g'>8] <g g'>\startTextSpan [<fis fis'> <e e'> \dimTextDim <fis fis'>8] \>

  <a a'>8 [<g g'> <fis fis'> <g g'>8] <d' g b d>4.\arpeggio <c c'>8

  <b g' b>4. a'8 <b, e a>8 e b <g g'>

  \time 2/4
  <a d fis a>2 
  \bar "||"

  \time 4/4
  <b dis fis b>2.  r8 b8-.-1 \stopTextSpan\!% ここで点線を終了
  % Aメロ開始：二重小節線と [A] マーク
  \bar "||"
  %{ \mark \default  % 自動で [A] が表示されるっす %}
  \mark \markup { \box \bold "A" }

  g'4^\markup { \italic "a tempo" }-5 r8 b,8-.-1 fis'4-4 r8 b,8-2
  
  e4-5 d8-.-4 [c-.-3] d4-4 r8 g,-.-1

  a-1 ([c-.-2) e-.-3 g8-.-5] fis-4 [(d-.-3) b-.-2 a-.-1]

  b2-3 r4 r8 b-.-1

  g'4-5 r8 b,8-.-1 fis'4-4 r8 b,-.-2

  e4-5 d8-.-4 [c-.-3] d4.-4 b8-.-2 
  
  a-1 [(c-.-2) e-.-3 g-.-4] a-4 [(b-.-5) fis-.-4 d-.-2]

  e2.-3 r8 b-1

  % Bメロ開始：二重小節線と [B] マーク
  \bar ".|:"
  \mark \markup { \box \bold "B" }
  g'4-5 r8 b,-1 fis'4-4 r8 b,-2

  <e-5 g,-1>4 d8-4 [c8-3] <d-4 g,-1>4 r8 g,-1 

  % -------------コレで一つの小節（4拍分）何をやっているのかわからなければ「楽譜 多声部記譜」で検索！------------
  <<
    { a8-1 [c-2 e-3 g-5]  fis-4 [d-2 b-3 a-2] } % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {r2                    a4-1      fis-1     } % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  % -------------コレで一つの小節（4拍分）------------
  <<
    {<d-1 g-3 b-5>2            r4     r8 b'-1}  % 上声部：8分音符×8個 ＝ 4拍分

    \\
    {r4           fis8-3 [e-1] dis4-2 fis-1} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  g'-5 r8 b,-1 fis'4-4 r8 b,-2

  e4-5 d8-4 [c-3] d4.-4 b8-2

  % -------------コレで一つの小節（4拍分）------------
  <<
    {a-1 [c-2 e-3 g-4] a-4 [b-5 fis-4 d-2]}  % 上声部：8分音符×8個 ＝ 4拍分

    \\
    {r2                d4-1        r4   } % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  % -------------コレで一つの小節（4拍分）------------
  <<
    {<g,-1 b-2 e-5>2.        r4}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {r2    r16 g-1 [a-2 b-3] c-1 [d-2 e-3 fis-4] } % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  % Cメロ開始：二重小節線と [C] マーク
  \bar "||"
  \mark \markup { \box \bold "C" }
  % -------------コレで一つの小節（4拍分）------------
  <<
    {g8-5 [g-5 g-5 g-5] g-5 [fis-4 e-3 fis-4]}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {<c-2 a-1>2      r2} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------mark

  % -------------コレで一つの小節（4拍分）------------
  <<
    {<d-2 fis,-1> r4 r8 c16-2[d-3]}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {r4 <a-1 a'-5> <g-1 g'-5> <fis-1 fis'-5>} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  % -------------コレで一つの小節（4拍分）------------
  <<
    {e'8-4 [e-5 e-5 e-5] e-5 [d-4 c-3 d-5]}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {<c-2 g-1>2 r2} % 下声部：2分休符×2個 ＝ 4拍分
  >>

  % -------------コレで一つの小節（4拍分）------------
  <<
    {<b-3 d,-1>2. r8 b-3}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {r4 <g-1 g'-5> <a-1 a'-5> <b-1 b'-5>} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  gis8-2 [a-1 c-3 e-5] <fis,-1 d'-4>4. c'8-3

  % -------------コレで一つの小節（4拍分）------------
  <<
    {ais-2 [b-1 d-2 fis-3] a-5[g-4 fis-3 g-4]}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {r2 <b,-1 d-2>4 r4} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  <cis-1 e-2 b'-5>4.\arpeggio a'16-4[b-5] e,4.-2 d16-4[e-5]

  b4.-3 a16-4[b-5] d2-2

  \time 2/4
  <fis,-3 dis-1>4 r8 b-1
 
  \bar ":|."
  \time 4/4
  <g-1 b-2 e-5>2. r4 

  % Dメロ開始：二重小節線と [D] マーク
  \bar "||"
  \mark \markup { \box \bold "D" }
  % -------------コレで一つの小節（4拍分）------------
  <<
    {r8 e'16-5[dis-4] e8-. -5 [c16-3 b-2] c8-. -3[a16-3 gis-2] a4-3}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {g4-1 r4 r2} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

    % -------------コレで一つの小節（4拍分）------------
  <<
    {r8 d'16-5[c-4] d8-. -5[b16-3 a-2] b8-. -3[g16-3 fis-2] g4-3}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {fis4-1 r4 r2} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  % -------------コレで一つの小節（4拍分）------------
  <<
    {r8 c'16-5[b-4] c8-. -5[a16-3 g-2] a8-. -3[fis16-3 dis-2] fis4-3}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {e4-1 r4 r2} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  % -------------コレで一つの小節（4拍分）------------
  <<
    {r8 b'16-4 [c-5] b16-. -4[a16-. -3 g-. -1 fis-. -2] g4-3 r4}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {dis4-1 r4 r2} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  % -------------コレで一つの小節（4拍分）------------
  <<
    {r8 e'16-4 [dis-5] e8-. -4[c16-4 b-3] c8-. -4[a16-3 gis-2] a4-3}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {g4-3 r4 r2} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------ 
  
  % -------------コレで一つの小節（4拍分）------------
  <<
    {r8 d'16-5 [c-4] d8-. -5[b16-4 a-3] b8-. -5[g16-3 fis-2] g4-3}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {fis4-1 r4 r2} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------ 

  % -------------コレで一つの小節（4拍分）------------
  <<
    {r8 c'16-5 [b-4] c8-. -5[a16-4 g-3] a8-. -4[fis16-3 eis-2] fis4-3}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {e4-1 r4 r2} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------
  
  % -------------コレで一つの小節（4拍分）------------
  <<
    {r8 b'16-4 [c-5] b16-. -4[a-. -3 g-. -1 fis-. -2] e4-1 r4}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {dis4-1 r4 r2} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

    % Eメロ開始：二重小節線と [E] マーク
  \bar "||"
  \mark \markup { \box \bold "E" }
  % -------------コレで一つの小節（4拍分）------------
  <<
    {r8 <e' g>16[<dis fis>] <e g>8[<b g>] c16[d c b] <a c>4}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {g4 r a r} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  % -------------コレで一つの小節（4拍分）------------
  <<
    {r8 <d fis>16[<c e>] <d fis>8[<fis, a>] b16[c b a] <g b>4}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {fis4 r g r} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  % -------------コレで一つの小節（4拍分）------------
  <<
    {r8 <c e>16[<b dis>] <c e>8[<g e>] a16[b a gis] <a fis>4}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {e r fis r} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  % -------------コレで一つの小節（4拍分:Eメロ４小節目）------------
  <<
    {r8 <c' e>16[<b dis>] <c e>8[<g e>] g16[a g fis] g[fis g b]}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {dis, r e r} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  \time 2/4 
  c'16[b a g] a[g fis e]

  \time 6/8
  % -------------コレで一つの小節（4拍分:Eメロ４小節目）------------
  <<
    {r8 <g e>[<fis d>] r8 <e cis>[<d b>] }  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {d2.} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % -------------コレで一つの小節（4拍分）------------

  <a e'>8.[<a e'>8.] <a e'>4. ~

  <a e'>4. r4.

  % Fメロ開始：二重小節線と [F] マーク
  \bar "||"
  \mark \markup { \box \bold "F" }
  \key d \major

  r8 fis''[a] <d, g b>8.[a'16 g8]

  <d fis a>8.[g16 fis8] <g d b>8.[fis16 e8]

  d[g b] <c g e>8.[b16 a8]

  <b g d>8.[a16 g8] <a c,>4.

  d,8[fis a] <d b g d>4\arpeggio <d d,>8

  <d d,>8.[<cis cis,>16 <b b,>8] <a d, b>4.

  % -------------コレで一つの小節（4拍分）------------
  <<
    {<g d g,>4 g8 f[e d]}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {r4. <c a>4.} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % ------ -------コレで一つの小節（4拍分）------------

  <d b g>4. r4.

  d8[fis a] <b g d>8.[a16 g8]

  <a fis d>8.[g16 a8] <g d b>8.[fis16 e8]
  
  d[g b] <c g e>8.[b16 a8]

  <b g d>8.[a16 g8] <a c,>4.

  d,8[fis a] <d b g>4 <d d,>8

  <d d,>[<cis cis,> <b b,>] <a d, b>4.

  % -------------コレで一つの小節（4拍分）------------
  <<
    {<g d b>4 g8 f[e d]}  % 上声部：8分音符×8個 ＝ 4拍分
    \\
    {r4. <c a>4.} % 下声部：2分休符×2個 ＝ 4拍分
  >>
  % ------ -------コレで一つの小節（4拍分）------------

  <d b g>2.

  % Fメロ開始：二重小節線と [G] マーク
  \bar "||"
  \mark \markup { \box \bold "G" }
  \key g \major

}
